# Код Морзе для представления цифр и букв использует тире и точки.
# Напишите функцию для кодирования текстового сообщения в соответствии с кодом Морзе.

morse_code = {
    '.-': 'A', '-...': 'B', '-.-.': 'C', '-..': 'D', '.': 'E', '..-.': 'F',
    '--.': 'G', '....': 'H', '..': 'I', '.---': 'J', '-.-': 'K', '.-..': 'L',
    '--': 'M', '-.': 'N', '---': 'O', '.--.': 'P', '--.-': 'Q', '.-.': 'R',
    '...': 'S', '-': 'T', '..-': 'U', '...-': 'V', '.--': 'W', '-..-': 'X',
    '-.--': 'Y', '--..': 'Z',
    '-----': '0', '.----': '1', '..---': '2', '...--': '3', '....-': '4', '.....': '5',
    '-....': '6', '--...': '7', '---..': '8', '----.': '9',
    ' ': ' '
}


def morse_encode(text: str) -> object:
    keys = list(morse_code.keys())
    code = ""
    for letter in text:
        if letter.upper() in keys:
            code = code + morse_code[letter.upper()] + " "
    return code


print(morse_encode("Sos soso"))
