# Дан словарь, ключ - Название страны, значение - список городов, на вход
# поступает город, необходимо сказать из какой он страны

cities = {
    "Беларусь": ["Минск", "Витебск", "Брест"],
    "Россия": ["Москва", "Санкт-Петербург", "Смоленск"],
    "Польша": ["Варшава", "Гданьск", "Краков"],
    "Италия": ["Рим", "Верона", "Венеция"],
    "Испания": ["Барселона", "Мадрид", "Валенсия"]
}

def get_key(my_dict: dict, value: str):
    for key, val in my_dict.items():
        if isinstance(val, list):
            if value in val:
                return key
        elif val is value:
            return key
    else:
        return None

print(get_key(cities, "Минск"))