# Пользователь вводит предложение, заменить все пробелы на "-" 2-мя способами

# Varity 1
text = "My first home work"
print("My first homework".replace(" ", "--"))

# Varity 2
a = 'My first homework'.replace(' ', '--')
print(a)